In [1]:
import pandas as pd

In [2]:
df_one = pd.DataFrame(
    {
        "k1": ["A",'A',"B","B","C","C"],
        "col1": [100,200,300,300,400,500],
        "col2": ["NY","CA","WA","WA","AK","NV"]
    }
)
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [3]:
df_one.drop_duplicates()

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
4  C   400   AK
5  C   500   NV

In [ ]:
Å›